[
  {
    "id": 1,
    "name": "Apollo Twilight Womens Mountain Bike - S, M, L Frames",
    "itemCode": 566296,
    "rating": 4.5,
    "reviewCount": 413,
    "originalPrice": "€205.00",
    "salePrice": "€150.00",
    "saveAmount": "€55",
    "frame": "Durable steel frame",
    "forks": "Front suspension fork",
    "gears": "18 speed Shimano gear set",
    "brakes": "Steel V-brakes",
    "wheels": "26inch Kenda tyres",
    "suspension": "Front Suspension",
    "description": "Enjoy riding in the great outdoors with the durable Apollo Twilight Women’s Mountain Bike, perfect for riders of all abilities who want to explore trails and enjoy countryside leisure rides. Apollo has gained a reputation for manufacturing quality bikes that offer exceptional value for money, and the Apollo Twilight certainly ticks both of these boxes. Mixing solid build quality with premium components, you’ll get plenty of bang for your buck with an Apollo Twilight Womens Mountain Bike.",
    "additionalInfo": [
      "Most sizes of this bike are suitable for a rear mounted child seat, unfortunately the small version is not compatible - in this instance you could opt for a pannier rack and pannier mounted child seat.",
      "Bike build available by our expert bike technicians. Learn more",
      "Unlimited safety checks",
      "Lifetime frame guarantee*",
      "*Please see our T&C's here"
    ],
    "features": {
      "frame": "Extra durable frame - Riding off-road can put additional stress on bike frames, but you’ll have no worries with the extra strong Apollo MTB hardtail steel frame.",
      "suspension": "Front suspension - Soaking up the collisions with rocks and tree stumps, the front suspension fork has 50mm of travel.",
      "gearsAndBrakes": "Apollo Twilight Mountain Bike gears and brakes - Getting up hills without a hassle is all down to your gears and a full Shimano 18 speed gear set will help you to transition from the flat to inclines without any clunky changes or sudden stops due to slipping chains.",
      "grip": "Get a grip - To prevent tyres from slipping and to add extra grip in those banked corners, the Apollo Twilight Women’s Mountain Bike comes with 26inch wheels and Kenda tyres as standard."
    },
    "maintenance": "TLC for your Apollo Twilight - Like all bikes, your new Apollo Twilight will need to be looked after once it has done some serious miles, so make sure it remains in top condition by checking out our CycleCare service.",
    "guarantee": "Our guarantee - At Halfords, we take bike quality seriously, which is why we offer a lifetime guarantee on the frame of your Apollo Twilight (terms and conditions apply).",
    "maxWeightLimit": "Learn more about our maximum weight limits on adult bikes here.",
    "images": [
      "URL1",
      "URL2",
      "URL3"
    ]
  },
  {
    "id": 2,
    "name": "Carrera Code Disc Mens Mountain Bike 2023 - Orange",
    "images": [
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeYellow.png?alt=media",
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeYellowFrame.png?alt=media",
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeYellowTyre.png?alt=media"
    ],
    "price": "€430.00",
    "variations": ["XS", "S", "M", "L", "XL"],
    "description": "It’s no surprise that the Carrera Code Disc fits in nicely to further complement our popular Carrera Mountain bike range. It has all the fantastic features of the Carrera Valour Mountain Bike including an all-new design with wider handlebars, shorter stem, and updated geometry. The Code Disc also features a 2x Shimano drivetrain and higher performance mechanical disc brake. ...",
    "features": {
      "frame": "Lightweight strong and durable Alloy frame",
      "forks": "Zoom 595s-AMS forks with 100mm of travel and lockout",
      "gears": "16 speed Shimano Altus gearing",
      "brakes": "Mechanical disc-brakes for smooth, controlled stopping",
      "wheels": "27.5” double walled rims for extra durability",
      "saddle": "Carrera Memory Foam Saddle for ultimate comfort on your ride",
      "punctureProtectionTyres": "Designed with an extra puncture resistant layer",
      "lifetimeFrameGuarantee": "Built strong and built to last",
      "additionalInfo": "Take us up on our free bike build and you’ll be on the road quicker with minimum hassle. With all the tools, equipment and training needed, we can get your bike built quickly and safely, and we’ll even get rid of the packaging for you. Plus, our free lifetime safety checks and lifetime frame guarantee mean you have the confidence to go further."
    },
    "extraInfo": "Most sizes of this bike are suitable for a rear mounted child seat, unfortunately the XS & small versions are not compatible - in these instances you could opt for a pannier rack and pannier mounted child seat. ...",
    "maintenance": "Keeping your bike in peak condition is key if you plan on having it a long time, so let Halfords look after your Carrera Code Disc with CycleCare. ..."
  },
  {
    "id": 3,
    "name": "Carrera Valour Disc Mens Mountain Bike - Silver",
    "price": "€520.00",
    "variations": ["XS", "S", "M", "L", "XL"],
    "approximateWeight": "14kg",
    "groupset": "Microshift, 2x8 (16 speed)",
    "forks": "Suntour XCM with 100mm of travel",
    "description": "With all the capability of a go-anywhere bike, the Carrera Valour Disc more than does the job and is almost exactly the same as the UK’s best selling Carrera Vengeance mountain bike. This new line features wider handlebars and shorter stems and modern frame geometry, making the Carrera Valour Disc bang up to date and an exciting ride. The 2x Microshift drivetrain and trigger shifters allow for easy gear changing and the Suntour suspension will encourage you to embrace the off-road adventure ahead. ...",
    "features": {
      "frame": "Lightweight strong and durable Alloy frame",
      "forks": "Suntour XCM forks with 100mm of travel",
      "gears": "16-speed Microshift gearing for easier hill climbs",
      "brakes": "Mechanical Disc Brakes for controlled and effortless braking",
      "wheels": "27.5\" double walled rims for extra durability",
      "saddle": "Carrera Saddle for ultimate comfort on your ride",
      "lifetimeFrameGuarantee": "Built strong and built to last",
      "additionalInfo": "Take us up on our free bike build and you’ll be on the road quicker with minimum hassle. With all the tools, equipment and training needed, we can get your bike built quickly and safely, and we’ll even get rid of the packaging for you. Plus, our free lifetime safety checks and lifetime frame guarantee mean you have the confidence to go further."
    },
    "extraInfo": "Most sizes of this bike are suitable for a rear mounted child seat, unfortunately the XS & small versions are not compatible - in these instances you could opt for a pannier rack and pannier mounted child seat. ...",
    "maintenance": "Bike build available by our expert bike technicians. Learn more about unlimited lifetime safety checks and lifetime guarantee on frames and rigid forks* ...",
    "images": [
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeWhite.png?alt=media",
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeWhiteFrame.png?alt=media",
      "https://firebasestorage.googleapis.com/v0/b/ppit-31389.appspot.com/o/MountainBikeWhiteTyre.png?alt=media"
    ]
  }
]
